Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/mailman-tm.tmx
Source language: en
Languages: ca_es

source: Generate binary message catalog from textual translation description. This program converts a textual Uniforum-style message catalog (.po file) into a binary GNU catalog (.mo file). This is essentially the same function as the GNU msgfmt program, however, it is a simpler implementation. Usage: msgfmt.py [OPTIONS] filename.po Options: -o file --output-file=file Specify the output file to write to. If omitted, output will go to a file named filename.mo (based off the input file name). -h --help Print this message and exit. -V --version Display version information and exit.
ca_es: Genera un catàleg de missatges binari a partir d'una traducció de text. Aquest programa converteix un catàleg de missatges de text en el format Uniforum (fitxer .po) en un catàleg binari del GNU (fitxer .mo). En essència, això és el mateix que fa el programa «msgfmt» del GNU, però aquesta n'és una implementació més simple. Forma d'ús: msgfmt.py [OPCIONS] nomdefitxer.po Opcions: -o fitxer --output-file=fitxer Especifica el fitxer de sortida on escriure. Si s'omet, la sortida s'escriurà a un fitxer anomenat nomdefitxer.mo (basat en el nom del fitxer d'entrada). -h --help Mostra aquest missatge i surt. -V --version Mostra la informació de la versió i surt.

source: Add a non-fuzzy translation to the dictionary.
ca_es: Afegeix una traducció no difusa al diccionari.

source: Return the generated output.
ca_es: Retorna la sortida generada.

source: Create a new, unpopulated mailing list. Usage: %(PROGRAM)s [options] [listname [listadmin-addr [admin-password]]] Options: -l language --language=language Make the list's preferred language `language', which must be a two letter language code. -u urlhost --urlhost=urlhost Gives the list's web interface host name. -e emailhost --emailhost=emailhost Gives the list's email domain name. -q/--quiet Normally the administrator is notified by email (after a prompt) that their list has been created. This option suppresses the prompt and notification. -h/--help Print this help text and exit. You can specify as many of the arguments as you want on the command line: you will be prompted for the missing ones. Every Mailman list has two parameters which define the default host name for outgoing email, and the default URL for all web interfaces. When you configured Mailman, certain defaults were calculated, but if you are running multiple virtual Mailman sites, then the defaults may not be appropriate for the list you are creating. You also specify the domain to create your new list in by typing the command like so: newlist --urlhost=www.mydom.ain mylist where `www.mydom.ain' should be the base hostname for the URL to this virtual hosts's lists. E.g. with this setting people will view the general list overviews at http://www.mydom.ain/mailman/listinfo. Also, www.mydom.ain should be a key in the VIRTUAL_HOSTS mapping in mm_cfg.py/Defaults.py if the email hostname to be automatically determined. If you want the email hostname to be different from the one looked up by the VIRTUAL_HOSTS or if urlhost is not registered in VIRTUAL_HOSTS, you can specify `emailhost' like so: newlist --urlhost=www.mydom.ain --emailhost=mydom.ain mylist where `mydom.ain' is the mail domain name. If you don't specify emailhost but urlhost is not in the virtual host list, then mm_cfg.DEFAULT_EMAIL_HOST will be used for the email interface. For backward compatibility, you can also specify the domain to create your new list in by spelling the listname like so: mylist@www.mydom.ain where www.mydom.ain is used for `urlhost' but it will also be used for `emailhost' if it is not found in the virtual host table. Note that '--urlhost' and '--emailhost' have precedence to this notation. If you spell the list name as just `mylist', then the email hostname will be taken from DEFAULT_EMAIL_HOST and the url will be taken from DEFAULT_URL (as defined in your Defaults.py file or overridden by settings in mm_cfg.py). Note that listnames are forced to lowercase.
ca_es: Crea una llista de correu nova buida. Forma d'ús: %(PROGRAM)s [opcions] [nomllista [adreça-adminllista [contrasenya-admin]]] Opcions: -l llengua --language=llengua Fes que «llengua» sigui la llengua preferida de la llista, la qual s'ha d'especificar com un codi de llengua de dues lletres. -u urlservidor --urlhost=urlservidor Estableix el nom del servidor per a la interfície web de la llista. -e servidorcorreu --emailhost=servidorcorreu Estableix el domini de correu de la llista. -q/--quiet Normalment es notifica l'administrador (havent-li-ho demanat) sobre la creació de la llista per correu electrònic. Aquesta opció suprimeix la pregunta i la notificació. -h/--help Mostra aquest missatge d'ajuda i surt. Podeu especificar tants arguments a la línia d'ordres com siguin necessaris: si en manca algun, se us demanarà. Cada llista del Mailman té dos paràmetres que defineixen el nom del servidor per defecte del correu sortint i l'URL per defecte per a la interfície web. Quan configureu el Mailman, algunes opcions son calculades, però si estàs executant múltiples sites virtuals de Mailman, el valor per defecte no serà el apropiat per a la llista que estàs creant. Pots especificar el domini per a crear la nova llista al nom de la llista aixi: mylist@www.mydom.ain on `www.mydom.ain' hauria de ser el hostname base de l'URL al host virtual de la llista. Ex. Amb aquesta configuració la gent veuria la llista generada a http://www.mydom.ain/mailman/listinfo. i també, www.mydom.ain hauria de ser una clau al VIRTUAL_HOSTS de mm_cfg.py/Defaults.py. Es consultarà per a proporcionar l'adreça del servidor de correu. Si no es pot trobar, www.mydom.ain es farà servir tant per l'interfaz web com per el correu electrònic. Si el nom de la llista és `mylist', el correu electrònic del s'agafarà de DEFAULT_EMAIL_HOST i l'URL de DEFAULT_URL (tal i com està definit al Defaults.py o al mm_cfg.py). Nota que els noms de les llistes han de ser en minúscules.

source: Unknown language: %(lang)s
ca_es: Llengua desconeguda: %(lang)s

source: Enter the name of the list:
ca_es: Introduïu el nom de la llista:

source: Enter the email of the person running the list:
ca_es: Introduïu l'adreça electrònica de l'encarregat de la llista:

source: Initial %(listname)s password:
ca_es: Contrasenya inicial de %(listname)s:

source: The list password cannot be empty
ca_es: La contrasenya de la llista no pot estar buida

source: Hit enter to notify %(listname)s owner...
ca_es: Premeu la tecla de retorn per a notificar el propietari de %(listname)s...

source: Run one or more qrunners, once or repeatedly. Each named runner class is run in round-robin fashion. In other words, the first named runner is run to consume all the files currently in its directory. When that qrunner is done, the next one is run to consume all the files in /its/ directory, and so on. The number of total iterations can be given on the command line. Usage: %(PROGRAM)s [options] Options: -r runner[:slice:range] --runner=runner[:slice:range] Run the named qrunner, which must be one of the strings returned by the -l option. Optional slice:range if given, is used to assign multiple qrunner processes to a queue. range is the total number of qrunners for this queue while slice is the number of this qrunner from [0..range). If using the slice:range form, you better make sure that each qrunner for the queue is given the same range value. If slice:runner is not given, then 1:1 is used. Multiple -r options may be given, in which case each qrunner will run once in round-robin fashion. The special runner `All' is shorthand for a qrunner for each listed by the -l option. --once -o Run each named qrunner exactly once through its main loop. Otherwise, each qrunner runs indefinitely, until the process receives a SIGTERM or SIGINT. -l/--list Shows the available qrunner names and exit. -v/--verbose Spit out more debugging information to the logs/qrunner log file. -s/--subproc This should only be used when running qrunner as a subprocess of the mailmanctl startup script. It changes some of the exit-on-error behavior to work better with that framework. -h/--help Print this message and exit. runner is required unless -l or -h is given, and it must be one of the names displayed by the -l switch. Note also that this script should be started up from mailmanctl as a normal operation. It is only useful for debugging if it is run separately.
ca_es: Executa un o més qrunners, una sola vegada o repetidament. Cada classe runner especificada s'executa d'una manera round-robin. En altres paraules, el primer runner donat s'executa per a consumir tots els fitxers que hi hagi en el seu directori en aquest moment. Quan aquest qrunner ha acabat, s'executa el següent per a consumir tots els fitxers en /el seu/ directori, i així successivament. El nombre total de d'iteracions es pot proporcionar en la línia d'ordres. Sintaxi: %(PROGRAM)s [opcions] Opcions: -r runner[:slice:range] --runner=runner[:slice:range] Executar el runner donat, que ha de ser un de les cadenes retornades per l'opció -l. Si es proporciona l'opcional rodanxa:rang, es fa servir per a assignar múltiples processos qrunner a una cua. range és el nombre total de qrunners per a aquesta cua, mentre que slice és el nombre d'aquest qrunner de [o...range]. Si fa servir la forma slice:range, més val que s'asseguri que a cada qrunner per a la cua se li dóna el mateix valor de range. Si no es proporciona slice:runner, es fa servir 1:1. Es poden proporcionar múltiples opcions -r, en aquest cas cada qrunner s'executarà una vegada d'una manera round-robin. El runner especial `All' és una drecera per a un qrunner per a cadascun dels llistats per l'opció -l. --onze -o Executar cada qrunner donat exactament una sola vegada a través del seu bucle principal. En cas contrari, cada qrunner s'executa indefinidament, fins que el procés rep un SIGTERM o SIGINT. -l /--list Mostrar els noms dels qrunners disponibles i surt. -*v / --verbose Apuntar més informació de depuració als logs. -h / --help Mostrar aquest missatge i sortir. es precisa un runner tret que s'indiqui -l o -h, i ha de ser un dels noms mostrats per l'opció -l.

source: %(name)s runs the %(runnername)s qrunner
ca_es: %(name)s executa el qrunner %(runnername)s

source: All runs all the above qrunners
ca_es: «All» executa tots els qrunners anteriors

source: No runner name given.
ca_es: No heu proporcionat cap nom de runner.

source: Reduce disk space usage for Pipermail archives. Usage: %(PROGRAM)s [options] file ... Where options are: -h / --help Print this help message and exit. Only use this to 'fix' archive -article database files that have been written with Mailman 2.1.3 or earlier and have html_body attributes in them. These attributes can cause huge amounts of memory bloat and impact performance for high activity lists, particularly those where large text postings are made to them. Example: %% ls -1 archives/private/*/database/*-article | xargs %(PROGRAM)s You should run `bin/check_perms -f' after running this script. You will probably want to delete the -article.bak files created by this script when you are satisfied with the results. This script is provided for convenience purposes only. It isn't supported.
ca_es: Redueix l'espai de disc dels arxius del Pipermail. Forma d'ús: %(PROGRAM)s [opcions] fitxer ... On les opcions són les següents: -h / --help Mostra aquest missatge d'ajuda i surt. Feu servir aquesta funció només per a «arreglar» els fitxers de base de dades «-article» dels arxius creats amb el Mailman 2.1.3 o amb versions anteriors i que continguin atributs «html_body». Aquests atributs poden portar a un ús excessiu de memòria i causar un impacte molt negatiu en el rendiment de llistes amb molta activitat, especialment en aquelles que continguin missatges de text molt llargs. Exemple: %% ls -1 archives/private/*/database/*-article | xargs %(PROGRAM)s Caldrà que executeu l'ordre «bin/check_perms -f» després d'haver executat aquest script. Un cop estigueu satisfet amb els resultats podreu suprimir els fitxers -article.bak que hagi creat aquest script, si així ho voleu. Aquest script s'inclou només per la seva utilitat i no forma part del Mailman.

source: Could not open file for reading: %(filename)s.
ca_es: No es pot obrir el fitxer per llegir: %(filename)s.

source: Error opening list %(listname)s... skipping.
ca_es: Error obrint la llista %(listname)s... saltant.

source: No such member: %(addr)s
ca_es: El membre no existeix: %(addr)s

source: User `%(addr)s' removed from list: %(listname)s.
ca_es: El usuari `%(addr)s' ha estat eliminat de la llista: %(listname)s.

source: Changing passwords for list: %(listname)s
ca_es: S'estan canviant les contrasenyes per a la llista: %(listname)s

source: New password for member %(member)40s: %(randompw)s
ca_es: Contrasenya nova per al subscriptor %(member)40s: %(randompw)s

source: Remove the components of a mailing list with impunity - beware! This removes (almost) all traces of a mailing list. By default, the lists archives are not removed, which is very handy for retiring old lists. Usage: rmlist [-a] [-h] listname Where: --archives -a Remove the list's archives too, or if the list has already been deleted, remove any residual archives. --help -h Print this help message and exit.
ca_es: Elimina els components d'una llista de correu amb inpunitat - compte! Això elimina (gairebé) tot rastre d'una llista de correu. Per defecte, els arxius de les llistes no són suprimits, el que és molt pràctic per a retirar llistes velles. Forma d'ús: rmlist [-a] [-h] nomllista On: --archives -a Suprimeix també els arxius de la llista, o si la llista ja ha estat esborrada, suprimeix els arxius residuals. --help -h Mostra aquest missatge d'ajuda i surt.

source: Removing %(msg)s
ca_es: Eliminant %(msg)s

source: %(listname)s %(msg)s not found as %(filename)s
ca_es: No s'ha trobat el missatge %(msg)s de la llista %(listname)s com a fitxer %(filename)s

source: No such list (or list already deleted): %(listname)s
ca_es: La llista no existeix (o la llista ja ha estat eliminada): %(listname)s

source: No such list: %(listname)s. Removing its residual archives.
ca_es: La llista no existeix: %(listname)s. Eliminant els seus fitxers residuals.

source: Not removing archives. Reinvoke with -a to remove them.
ca_es: No s'estan eliminant els fitxers. Re-invoca amb l'opció -a per eliminar-los.

source: list info
ca_es: informació de la llista

source: stale lock file
ca_es: fitxer de bloqueig obsolet

source: private archives
ca_es: fitxers privats

source: public archives
ca_es: fitxers públics

source: Show the contents of one or more Mailman queue files. Usage: show_qfiles [options] qfile ... Options: -q / --quiet Don't print `helpful' message delimiters. -h / --help Print this text and exit. Example: show_qfiles qfiles/shunt/*.pck
ca_es: Mostra el contingut d'un o més fitxers de cua del Mailman. Forma d'ús: show_qfiles [opcions] qfile ... Opcions: -q / --quiet No mostris els delimitadors descriptius dels missatges. -h / --help Mostra aquest text i surt. Exemple: show_qfiles qfiles/shunt/*.pck

source: Synchronize a mailing list's membership with a flat file. This script is useful if you have a Mailman mailing list and a sendmail :include: style list of addresses (also as is used in Majordomo). For every address in the file that does not appear in the mailing list, the address is added. For every address in the mailing list that does not appear in the file, the address is removed. Other options control what happens when an address is added or removed. Usage: %(PROGRAM)s [options] -f file listname Where `options' are: --no-change -n Don't actually make the changes. Instead, print out what would be done to the list. --welcome-msg[=<yes|no>] -w[=<yes|no>] Sets whether or not to send the newly added members a welcome message, overriding whatever the list's `send_welcome_msg' setting is. With -w=yes or -w, the welcome message is sent. With -w=no, no message is sent. --goodbye-msg[=<yes|no>] -g[=<yes|no>] Sets whether or not to send the goodbye message to removed members, overriding whatever the list's `send_goodbye_msg' setting is. With -g=yes or -g, the goodbye message is sent. With -g=no, no message is sent. --digest[=<yes|no>] -d[=<yes|no>] Selects whether to make newly added members receive messages in digests. With -d=yes or -d, they become digest members. With -d=no (or if no -d option given) they are added as regular members. --notifyadmin[=<yes|no>] -a[=<yes|no>] Specifies whether the admin should be notified for each subscription or unsubscription. If you're adding a lot of addresses, you definitely want to turn this off! With -a=yes or -a, the admin is notified. With -a=no, the admin is not notified. With no -a option, the default for the list is used. --file <filename | -> -f <filename | -> This option is required. It specifies the flat file to synchronize against. Email addresses must appear one per line. If filename is `-' then stdin is used. --help -h Print this message. listname Required. This specifies the list to synchronize.
ca_es: Sincronitza els membres d'una llista de distribució amb un fitxer de text. Aquest script és útil si té una llista de distribució de Mailman i una llista d'adreces del tipus :include: de sendmail (com les que es fan servir també a Majordomo). S'afegeixen les adreces del fitxer que no estigui subscrites en la llista. S'esborren les adreces subscrites a la llista que no estiguin en el fitxer. Altres opcions controlen que passa quan s'afegeix o elimina una adreça. Forma d'ús: %(PROGRAM)s [opcions] -f file listname On les opcions són: --no-change -n No fer canvis, només mostrar lo que passaria a la llista. --welcome-msg[=<yes|no>] -w[=<yes|no>] Estableix si enviar o no als nous subscriptors un missatge de benvinguda, ignorant el que digui la preferència `send_welcome_msg' de la llista. Amb -w=yes o -w, s'envia el missatge de benvinguda. Amb -w=no, no s'envia cap missatge. --goodbye-msg[=<yes|no>] -g[=<yes|no>] Controla si s'envien missatges informatius quan s'esborrin adreces de la llista, ignorant qualsevol valor que tingui el paràmetre `send_goodbye_msg' de la llista. Amb -g=no no s'envia cap missatge. --digest[=<yes|no>] -d[=<yes|no>] Controla si els subscriptors nous tindran el lliurament en forma de resum. Amb -d o -d=yes es donaran d'alta com subscriptors amb el lliurament diferit en recopilacions. Amb -d=no es donaran d'alta com subscriptors regulars. --notifyadmin[=<yes|no>] -a[=<yes|no>] Especifica si l'administrador hauria de ser notificat de cada subscripció o cancel·lació de subscripció. Si està afegint un munt d'adreces, ¡segur que vol inhabilitar-lo! Amb -a=yes o -a, s'avisa a l'administrador. Amb a=no, l'administrador no rep avisos. Sense l'opció -a, es fa servir el valor que tingui configurada la llista.. --file <filename | -> -f <filename | -> Aquesta opció és obligatòria. Especifica el fitxer de text amb el qual sincronitzar-se. Les adreces de correu electrònic han d'aparèixer cadascuna en una línia distinta. Si el nom de fitxer és `-' es llegeixen les adreces de l'entrada estàndard. --help -h Mostra aquest missatge. listname Requerit. Això especifica la llista a sincronitzar.

source: Bad choice: %(yesno)s
ca_es: Elecció errònia: %(yesno)s

source: Dry run mode
ca_es: mode d'execució sec

source: Only one -f switch allowed
ca_es: Nomes es permet un indicador -f

source: No argument to -f given
ca_es: No s'han donat arguments a -f

source: Illegal option: %(opt)s
ca_es: Opció errònia: %(opt)s

source: No listname given
ca_es: No s'ha donat el nom de la llista

source: Must have a listname and a filename
ca_es: Es necessari tenir un nom de llista i un nom de fitxer

source: Cannot read address file: %(filename)s: %(msg)s
ca_es: No es pot llegir el fitxer d'adreça: %(filename)s: %(msg)s

source: Ignore : %(addr)30s
ca_es: Ignorar : %(addr)30s

source: Invalid : %(addr)30s
ca_es: invàlid : %(addr)30s

source: You must fix the preceding invalid addresses first.
ca_es: Primer has de fixar l'anterior adreça invàlida.

source: Added : %(s)s
ca_es: afegit : %(s)s

source: Removed: %(s)s
ca_es: Eliminat: %(s)s

source: Check a given Mailman translation, making sure that variables and tags referenced in translation are the same variables and tags in the original templates and catalog. Usage: cd $MAILMAN_DIR %(program)s [-q] <lang> Where <lang> is your country code (e.g. 'it' for Italy) and -q is to ask for a brief summary.
ca_es: Comprovar una tradució del Mailman, assegurant-se que les variables i els tags als que es fa referencia a la traducció son els mateixos que hi ha a la plantilla original. Forma d'ús: cd $MAILMAN_DIR %(program)s [-q] <lang> On <lang> és el codi del país (ex 'it' per a Italia) i -q es per demanar un resum.

source: check a translation comparing with the original string
ca_es: comprovar una traducció comparant-la amb la cadena original

source: scan a string from the original file
ca_es: Escanejar una cadena des del fitxer original

source: scan a translated string
ca_es: escanejar una cadena traduïda

source: check for differences between checked in and checked out
ca_es: Comprovar les diferencies entre els que s'han descarregat i els que s'han de pujar

source: parse a .po file extracting msgids and msgstrs
ca_es: analitzar sintàcticament un fitxer .po extraient msgids i msgstrs

source: States table for the finite-states-machine parser: 0 idle 1 filename-or-comment 2 msgid 3 msgstr 4 end
ca_es: Taula d'estats per la finite-states-machine parser: 0 inactiu 1 fitxer o comentari 2 msgid 3 msgstr 4 fi

source: check a translated template against the original one search also <MM-*> tags if html is not zero
ca_es: comprovar la plantilla traduïda amb l'original buscar també etiquetes <MM-*> si l'html no és zero

source: scan the po file comparing msgids with msgstrs
ca_es: escanejar el fitxer po comparant msgids amb msgstrs

source: Cannot unshunt message %(filebase)s, skipping: %(e)s
ca_es: No es pot treure el missatge %(filebase)s, s'ometrà: %(e)s

source: Perform all necessary upgrades. Usage: %(PROGRAM)s [options] Options: -f/--force Force running the upgrade procedures. Normally, if the version number of the installed Mailman matches the current version number (or a `downgrade' is detected), nothing will be done. -h/--help Print this text and exit. Use this script to help you update to the latest release of Mailman from some previous version. It knows about versions back to 1.0b4 (?).
ca_es: Portar a terme totes les actualitzacions necessaries. Forma d'ús:: %(PROGRAM)s [options] Opcions: -f/--force Forçar l'actualització. Normalment, si el nombre de la versió instalada de Mailman coincideix amb la versió actual (o si es detecta un `downgrade' ), no es fa res. -h/--help Mostra aquest text i surt. Fes servir aquest script per actualitzar a la última versió de Mailma a partir d'una versió anterior. Reconeix versions fins a la 1.0b4(?).

source: Fixing language templates: %(listname)s
ca_es: S'està fixant la plantilla de llengua: %(listname)s

source: WARNING: could not acquire lock for list: %(listname)s
ca_es: Atenció: no s'ha pogut adquirir el bloqueig de la llista: %(listname)s

source: Resetting %(n)s BYBOUNCEs disabled addrs with no bounce info
ca_es: S'estan posant a zero %(n)s BYBOUNCEs adreces inhabilitades sense informació de rebot

source: Updating the held requests database.
ca_es: S'està actualitzant la base de dades de peticions retingudes.

source: For some reason, %(mbox_dir)s exists as a file. This won't work with b6, so I'm renaming it to %(mbox_dir)s.tmp and proceeding.
ca_es: Per alguna raó, %(mbox_dir)s existeix com a fitxer. Això no funcionarà amb la b6, així que es canviarà el nom a %(mbox_dir)s.tmp i es continuarà.
